% 导入数据
load('ym.mat');

% 图像坐标 - (u,v,1)
u = xy(:,1)';
v = xy(:,2)';
U = [u;v];
U = U(:);

% (m,n) - (18,3)
[m,n] = size(XYZ);
x = xy;
X = XYZ;

% 标定块有m个已知点 -> 2n个关于M矩阵元素的线性方程
K1 = zeros(2*m,11);
for i=1:m
   K1(2*i-1,:) = [X(i,:),1,0,0,0,0,-x(i,1)*X(i,:)];
   K1(2*i,:) = [0,0,0,0,X(i,:),1,-x(i,2)*X(i,:)];
end

% 投影矩阵M
% KM=U -> M=inv(K'* K)*(K'* U)
% 4.14
M  = (K1'* K1)\(K1'* U);

M = [M;1];
M = reshape(M,4,3);
M = M'
M1 = M(1,1:3)';
M2 = M(2,1:3)';
M3 = M(3,1:3)';
M_34 = 1/norm(M3);

% m34*m3=r3
% r3->正交单位矩阵的第三行,abs(r3)=1
r3 = M_34*M3;        % 4.17
u0 = M_34^2*M1'*M3;  % 4.18
v0 = M_34^2*M2'*M3;  % 4.19
ax = M_34^2*norm(cross(M1,M3));  % 4.20
ay = M_34^2*norm(cross(M2,M3));  % 4.21

r1 = M_34/ax*(M1-u0*M3);   % 4.22
r2 = M_34/ay*(M2-v0*M3);   % 4.23
tz = M_34;                 % 4.24
tx = M_34/ax*(M(1,4)-u0);  % 4.25
ty = M_34/ay*(M(2,4)-v0);  % 4.26

% input->output,求取内外参
% 4.15
M_in=[ax,0,u0,0; 0,ay,v0,0; 0,0,1,0]
M_out=[r1',tx; r2',ty; r3',tz; 0,0,0,1]
